#สร้างโปรแกรมคำนวณอายุของจากปีเกิด (พ.ศ.) ของพนักงานโรงงานแห่งหนึ่ง โดยป้อนชื่อและปีเกิดทางแป้นพิมพ์ ทั้งนี้โปรแกรมจะหยุดทำงานก็ต่อเมมื่อป้อนชื่อพนักงาน เป็น SAU ก็จะหยุดทำงาน

from datetime import datetime

print("=====================================")
print("โปรแกรมคำนวณอายุของพนักงานโรงงาน")
print("=====================================") 

while True:
    name = input("ป้อนชื่อพนักงาน : ")
    if name.upper() == "SAU" :
        break
    birth_year = int(input("ป้อนปีเกิด (พ.ศ.) : "))
    age = (datetime.now().year + 543) - birth_year
    print(f"พนักงาน {name} มีอายุ {age} ปี")
    print("=====================================")

print("=====================================")
print("thank you for using our program.")
print("=====================================")