# สร้างโปรแกรมคำนวณค่า BMI โดยรับ ชื่อ ค่าส่วนสูง(เซ็นติเมตร) และนำหนัก (กิโลกรัม) ทางแป้นพิมพ์ แล้วแสดงผลค่า BMI ที่คำนวณได้ทางหน้าจอ โดย
# BMI =  น้ำหนัก หารด้วย ส่วนสูง(เมตร)ยกกำลัง2

# --------------------------------
#    โปรแกรม BMI CALCULATOR
# --------------------------------
# ป้อนชื่อ: <input>
# ป้อนน้ำหนัก: (kg) <input>
# ป้อนส่วนสูง: (cm) <input>
# --------------------------------
# คุณ <output> หนัก <output> kg. สูง <output> m.
# มีค่า BMI เป็น <output>
# --------------------------------

print('=========================')
print(' BMI CALCULATOR ')
print('=========================')

Name = input('ป้อนชื่อ : ')
wight = float(input('enter wight : ') )
height = float(input('enter height(cm) : ') ) / 100


BMI = wight / (height ** 2) 

print('=============================')
print('Name {} หนัก {} kg. สูง {} cm'.format(Name,wight,height*100))
print('มีค่า BMI {:.2f}'.format(BMI))
