#สร้างโปรแกรม Money Share V. 1.0 เพื่อคำนวณหาเงินที่ต้องการกันคนละกี่บาท 
# โดยป้อนจำนวนเงินและจำนวนคนทางแป้นพิมพ์แล้วแสดงผลเงินที่ต้องหารกันว่าต้องหารคนละกี่บาททางหน้าจอ
# ------------------------
#    โปรแกรม Money Share
# ------------------------
# ป้อนจำนวนเงิน: <input>
# ป้อนจำนวนคน: <input>
# ------------------------
# สรุปหารกันคนละ: <output> บาท
# ------------------------

print('===================')
print(' Money Share ')
print("===================")

Money = int(input('Money : ') )
user = int(input('user :') )

sum = Money / user


print(f'สรุปหารกันคนละ : {sum:.2f}')

