# โปรแกรมซึ่งรับชื่อ และปีเกิดของผู้ใช้โปรแกรมทางแป้นพิมพ์ โดยหากอายุมีค่าตั้งแต่ 55 ปีขึ้นไป 
# ให้แสดงข้อความว่า "คุณแก่แล้ว..." หากไม่ถึงให้แสดงข้อความ "คุณยังไม่แก่..." ทางหน้าจอ

from datetime import datetime


print('-------------------------------')
print(' Program check age-range')
print('-------------------------------')

y_name = input('ป้อนชื่อ ==>> ')
y_yearborn = int(input('ป้อนปีเกิด (พ.ศ.) ==>>'))

print('-------------------------------')

y_age = (datetime.now().year + 543 ) - y_yearborn

if y_age >= 55 : 
    print('คุณ {} อายุ {} ปี แก่แล้วนะ'.format(y_name,y_age))
    print('เข้าใจ คนวัยนี้...')
else : 
    print('คุณ {} อายุ {} ปี ยังไม่ถึงเวลา'.format(y_name,y_age))
    print('เด็กพึ่งเกิด...')