#Control Flow คือ กระบวนการทำงานของโปรแกรม ใช้คู่กับ control statement
#Control Flow มี 2 ประเภท
# -Selection/Decision แบบเลือกทำ คือ ต้องพิสูจน์/ตรวจสอบก่อนที่จะทำงานใดๆ โดยมี 3 แบบย่อย
# -พิสูจน์ตรวจสอบครั้งเดียว จริงทำ เท็จไม่ทำ (if)
# -พิสูจน์ตรวจสอบครั้งเดียว จริงทำ เท็จก็ทำ (if-else)
# -พิสูจน์ตรวจสอบหลายครั้ง (if-elif-else)
#2.loop/iteration/Repetition แบบทำซ้ำ ตือ ทำงานเดิมๆ ซำ้มี 2 แบบย่อย
# -รู้จำนวนครั้งในการทำซ้ำ
# -ไม่รุ้จำนวนครั้งในการทำซ้ำ
# *** การทำซ้ำต้องรู้จบ
# Control Statement -> คำสั่ง while, for