# โปรแกรมทายตัวเลข โดยมีการทำงานของโปรแกรมดังนี้
# - ให้ผู้ใช้ทายตัวเลขโดยการป้อนตัวเลขทางแป้นพิมพ์
# - โดยกรณีที่ตัวเลขที่ป้อนมีค่าเท่ากับ 59 ให้แสดงข้อความ “ยินดีด้วยคุณทายถูก”
# - แต่หากตัวเลขที่ป้อนมีค่ามากหรือน้อยกว่า 59 ให้แสดงข้อความ “คุณทายผิดตัวเลขที่ป้อนมากไป” หรือ “คุณทายผิดตัวเลขที่ป้อนน้อยไป” และให้ผู้ใช้ป้อนใหม่  โดยโปรแกรมจะวนให้ผู้ใช้ป้อนไปเรื่อยๆ จนกว่าจะทายถูก


from random import randint
random_number = randint(1, 100)

print("========================================")
print(" โปรแกรมทายตัวเลข ") 
print("========================================")

while True:
        user_input = int(input("ลองเดาเลขดู : "))
        if user_input == random_number:
            print("ถูกต้องแล้วนะค้าบบบ ! ถูกเฉยยยย .")
            break
        elif user_input < random_number:
            print("ต่ำไปหน่อยยย. ลองอีกที.")
        else:
            print("สูงงงงไปหน่อย. ลองใหม่.")
    
print("========================================")
print("Thank you for playing  game.")